Could not change type due to highlighted infilling element. 'Sloped glazing' infills are not allowed.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId InfillNoSlopeGlazing { get; }
  Visual Basic
Public Shared ReadOnly Property InfillNoSlopeGlazing As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ InfillNoSlopeGlazing {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures InfillFailures Class
  Autodesk.Revit.DB Namespace